{
    "recetas": [
        {
            "ID": "1",
            "titulo": "Sandwich de Jamon y Cheddar",
            "subtitulo": "Receta de panes caseros para hacer deliciosos sandwiches",
            "ingredientes": [
                {
                    "1": "500 gramos de harina de trigo",
                    "2": "10 gramos de levadura seca o 25 gramos de levadura fresca",
                    "3": "250 ml de leche tibia",
                    "4": "50 gramos de mantequilla derretida",
                    "5": "1 huevo",
                    "6": "1 cucharadita de sal",
                    "7": "200 gramos de jamón cocido",
                    "8": "200 gramos de queso cheddar",
                    "9": "Aceite vegetal para engrasar"
                }
            ],
            "pasos": [
                {
                    "1": "La masa: En un bol grande, mezcla la harina y la sal. En otro recipiente pequeño, disuelve la levadura en la leche tibia. Deja reposar unos minutos hasta que empiece a burbujear. Agrega la mezcla de levadura y leche a la harina. También agrega la mantequilla derretida y el huevo. Mezcla bien hasta formar una masa homogénea.",
                    "2": "Amasar: Espolvorea un poco de harina sobre una superficie limpia y lisa. Volca la masa sobre esta superficie y amasa durante unos 10 minutos o hasta que la masaesté suave y elástica.",
                    "3": "Levantar la masa: Engrasa un bol con aceite vegetal y coloca la masa dentro. Cubre el bol con un paño limpio y deja reposar la masa en un lugar cálido durante aproximadamente 1 hora, o hasta que duplique su tamaño.",
                    "4": "Los ingredientes: Precalienta el horno a 180°C (350°F). Corta el jamón y el queso cheddar en trozos pequeños para el relleno.",
                    "5": "Armar los panes: Después de que la masa haya duplicado su tamaño, colócala sobre una superficie enharinada y divídela en porciones del tamaño deseado para tus panes. Estira cada porción de masa en un círculo. Coloca una porción de jamón y queso cheddar en el centro de cada círculo de masa.",
                    "6": "Cerrar y hornear: Dobla la masa sobre el relleno para cerrarla, formando una especie de empanada o bolsillo. Coloca los panes en una bandeja de horno previamente engrasada o cubierta con papel de hornear. Deja que los panes reposen unos 10 minutos mientras el horno termina de calentarse. Lleva al horno y hornea por unos 20-25 minutos o hasta que estén dorados y cocidos por dentro."
                }
            ],
            "imagen": "../img/sandwich.png",
            "autorID": "1",
            "fechaCreacion": "16/05/2024"
        },
        {
            "ID": "2",
            "titulo": "Pizza margarita",
            "subtitulo": "Receta clásica de pizza margarita con masa casera",
            "ingredientes": [
                {
                    "1": "500 g de harina de trigo",
                    "2": "325 ml de agua",
                    "3": "15 g de sal",
                    "4": "5 g de levadura seca activa",
                    "5": "400 g de tomate triturado",
                    "6": "250 g de queso mozzarella rallado",
                    "7": "Un puñado de hojas de albahaca fresca",
                    "8": "2 cucharadas de aceite de oliva"
                }
            ],
            "pasos": [
                {
                    "1": "Precalienta el horno a 245°C (475°F).",
                    "2": "Estira la masa de pizza en una superficie enharinada hasta el grosor deseado.",
                    "3": "Transfiere la masa estirada a una bandeja de horno o piedra para pizza.",
                    "4": "Extiende una capa fina de salsa de tomate de manera uniforme sobre la masa.",
                    "5": "Espolvorea queso mozzarella rallado sobre la salsa.",
                    "6": "Agrega hojas de albahaca fresca encima del queso.",
                    "7": "Rocía aceite de oliva sobre la pizza.",
                    "8": "Hornea en el horno precalentado durante aproximadamente 12-15 minutos, o hasta que la corteza esté dorada y el queso esté derretido y burbujeante.",
                    "9": "Retira del horno y deja enfriar unos minutos antes de cortar y servir."
                }
            ],
            "imagen": "../img/pizza-margherita.jpg",
            "autorID": "2",
            "fechaCreacion": "26/05/2024"
        },
        {
            "ID": "3",
            "titulo": "Ravioles de espinaca",
            "subtitulo": "Receta de pasta rellena con espinaca y ricota",
            "ingredientes": [
                {
                    "1": "200 g de harina de trigo",
                    "2": "2 huevos",
                    "3": "300 g de espinacas frescas",
                    "4": "250 g de ricotta",
                    "5": "50 g de queso parmesano rallado",
                    "6": "Sal al gusto",
                    "7": "Pimienta al gusto",
                    "8": "Nuez moscada al gusto"
                }
            ],
            "pasos": [
                {
                    "1": "Lava y cocina las espinacas en agua hirviendo durante unos minutos. Luego escúrrelas bien y pícalas finamente.",
                    "2": "En un bol, mezcla las espinacas picadas con la ricotta, el queso parmesano, la sal, la pimienta y la nuez moscada. Reserva el relleno.",
                    "3": "En otro bol, coloca la harina y haz un hueco en el centro. Añade los huevos en el hueco y mezcla bien hasta obtener una masa homogénea.",
                    "4": "Amasa la mezcla durante unos 10 minutos hasta que la masa esté suave y elástica. Cubre la masa con un paño húmedo y deja reposar durante 30 minutos.",
                    "5": "Divide la masa en porciones y estírala con un rodillo o una máquina de pasta hasta obtener láminas finas.",
                    "6": "Coloca pequeñas porciones del relleno de espinacas y ricotta sobre una lámina de masa, dejando espacio entre cada porción.",
                    "7": "Cubre con otra lámina de masa y presiona alrededor de cada porción de relleno para sellar los ravioles. Corta los ravioles con un cortador de pasta o un cuchillo.",
                    "8": "Cocina los ravioles en abundante agua hirviendo con sal durante 3-4 minutos, o hasta que floten a la superficie.",
                    "9": "Escurre los ravioles y sírvelos con tu salsa favorita."
                }
            ],
            "imagen": "../img/ravioles.jpeg",
            "autorID": "3",
            "fechaCreacion": "03/06/2024"
        }
    ]
}